package com.example.etasheva.fragmentsapp.models;

import java.util.ArrayList;
import java.util.List;

public class Database {

    private List<Article> articles;

    public Database() {
        this.articles = new ArrayList<>();
        this.fillDatabase();
    }

    public int getArticlesCount(){
        return this.articles.size();
    }

    public Article getArticleByPosition(int position){
        return this.articles.get(position);
    }

    private void fillDatabase() {
        this.articles.add(new Article("Ромка прави нелегални цигари, задържаха я",
                "Полицията в Пловдив задържа 31 годишна ромка, в чийто дом бяха открити 15 кг контрабанден тютюн. Освен него униформените намерили и машина за обработката му и електронна везна.\n" +
                "Спецакцията е била проведена в кв. \"Столипиново\", информира  \"24 часа\".\n" +
                "Ромката е задържана, а срещу нея е образувано бързо производство. \n" +
                "В ареста е и асеновградчанин, който на ул. \"Шести януари\" бил заловен да пренася общо 54 600 цигари от различни марки без бандерол. \n" +
                "Междувременно на територията на общинския пазар в Стамболийски служителите на реда установили няколко човека, които предлагат за продажба безакцизен тютюн . От тримата са иззети общо 14 кг.",
                "11.09.2016 11:47"));

        this.articles.add(new Article("Задържаха столичанин за превоз на мигранти от Афганистан",
                "Столичанин с инициали Р. Д. на 40 години е задържан в полицията за превоз на мигранти от Афганистан. Това съобщиха от Областна дирекция на МВР във Видин. \n" +
                "Чужденците са открити вчера в землището на село Раковица, община Макреш около 18.30 часа в автомобил Фолксваген \"Кади\", шофиран от 40-годишния мъж. В колата са пътували 11 души (петима възрастни и 6 деца), които отговарят на профила \"нелегален мигрант\".\n" +
                 "Чужденците са доведени в РУ-Кула, установена е самоличността им - граждани на Афганистан. Пълнолетните са задържани, на децата е предоставена полицейска закрила. Предстои извеждането им от обслужваната територия.",
                "10.09.2016 13:02"));

        this.articles.add(new Article("Заловиха рецидивист, избягал от затвора в Бургас",
                "Новозагорски криминалисти задържаха рецидивист, избягал от затвора в Бургас, извършил серия кражби от къщи в Новозагорско, съобщиха от Областната дирекция на МВР в Сливен.\n" +
                 "Той е влизал в домовете на хората през отворени прозорци. От края на август в полицията в Нова Загора са регистрирани заявления за кражба на пари, златни накити и други ценности.\n" +
                 "На 8 септември полицейските служители са задържали в новозагорското село Питово криминално проявения и осъждан В.В. от град Камено, област Бургас, обявен за общодържавно издирване като беглец от затвора в Бургас - незавърнал се от домашен отпуск.\n" +
                 "Полицейските служители предприемат незабавни процесуално-следствени действия в обитавания от В.В. имот в Питово. На място е установен и криминално проявения С.С. от град Шивачево.\n" +
                 "От жилището са иззети 8550 лв., 300 евро, голямо количество златни накити, ръчни часовници, мобилни телефони, таблет и други веществени доказателства, свързващи В.В. и С.С. с извършените домови кражби на територията на община Нова Загора. Двамата са задържани за 24 часа.",
                "10.09.2016 12:22"));

        this.articles.add(new Article("Взривиха банкомат в Русе",
                "Банкомат е бил взривен тази нощ в Русе, съобщиха от областната дирекция на полицията в града.\n" +
                        "        В 3,14 часа е получен сигнал за посегателство над банкомат, намиращ се в магазин на улица \"Рига\". На мястото е изпратена дежурна оперативна група на МВР за извършване на оглед и изясняване на случая.\n" +
                        "        При инцидента няма пострадали хора, но са нанесени материални щети по устройството и витрините на магазина. Към момента няма данни да липсват пари от банкомата, допълват от полицията.\n",
                "10.09.2016 11:58"));

        this.articles.add(new Article("Момче от център за социални услуги в Ловеч скочи от сграда",
                " Момче, настанено в Център за наставане от семеен тип /ЦНСТ/ в Ловеч, е направил опит за самоубийство и е скочило от двуетажна сграда в града, съобщиха от областната дирекция на МВР. То е настанено в ловешката болница с леки наранявания и без опасност за живота, добавиха от полицията. За случая е уведомена и прокуратурата.\n" +
                        "        Инцидентът е станал в петък. Около 18.00 часа 17-годишното момче, криминално проявено, е буйствало пред Центъра и на място е извикан екип на \"Самоохрана, контрол, обществен ред и сигурност\" /БД СКОРС/.\n" +
                        "        След това момчето е избягало и се е качило на покрива на бившия закрит басейн в града. Заплашило е, че ще се самоубие, пристигнали са екипи на полицията и пожарната.\n" +
                        "        След това младежът е скочил върху площадка. Екип на спешна помощ го е откарал в ловешката болница, където е настанен в детското отделение. От Центъра за спешна медицинска помощ съобщиха, че момчето е било с алкохолна интоксикация и е буйствало.\n",
                "10.09.2016 10:52"));

        this.articles.add(new Article("Шестима загинаха при 20 тежки катастрофи през денонощието",
                "През изминалото денонощие по пътищата на страната са загинали шестима души при 20 тежки катастрофи, съобщи пресцентърът на МВР.\n" +
                        "        Ранените са 19, като един от тях е с опасност за живота.\n" +
                        "        В София са станали 136 леки катастрофи и две тежки. Един човек е загинал, а двама са ранени.\n" +
                        "        От началото на годината 475 души са загубили живота си при пътни произшествия.",
                "10.09.2016 09:32"));

        this.articles.add(new Article("Изоставен багаж вдигна на крак полицията в София",
                "Изоставен багаж вдигна на крак полицията в София тази нощ.\n" +
                        "        Беше извършен контролиран взрив на багажа, изоставен на една от алеите зад джамията, съобщи Нова тв.\n" +
                        "        Силният гръм от взрива малко след 23.00 часа изправи на нокти живеещите в района на Централните хали. Джамията и градинката зад нея бяха отцепени от полицията. На място имаше екипи на Спешна помощ и пожарната.\n" +
                        "        Според живеещите наоколо багажът бил оставен от бежанци, които отдавна били превърнали градинката в свой дом. По пейките често оставяли дрехи, обувки и одеяла. Жителите на района твърдят, че отдавна вече избягват от там.\n" +
                        "        След като изоставеният багаж беше обезвреден, екип на ДОТИ започна работа по установяване на съдържанието му.",
                "10.09.2016 08:48"));

        this.articles.add(new Article("Меркел ни праща джипове за охрана на границата ни",
                "Ocем нови високопроходими джипове ще пристигнат в България от Германия. Новите машини трябва да пристигнат през ноември. Те са обещани лично от канцлера Ангела Меркел." +
                "България ще получи още термовизионни камери и автобуси. Това каза пред журналисти министърът на вътрешните работи Румяна Бъчварова. Днес тя посети южната граница, където се строи пограничното оградно съоръжение." +
                "До няколко дни ще пристигнат и джипове втора употреба, но в добро състояние, предаде БТА." +
                "Бъчварова каза, че цялата техника ще бъде разположена в местния пограничен район.Част от английските джипове, изпратените от вече бившия британски премиер Дейвид Камерън, са аварирали. Дарението пристигна у нас през май тази година." +
                "Техниката, която обслужва граничните служители, е зле, заяви Бъчварова. България ще се опита да се справи с наличните в момента бежански центрове, добави министърът. По думите й няма планове за изграждането на нови такива у нас." +
                "Министърът уточни, че в сравнение с миналата година има спад с 30 на сто на преминалите българо-турската граница мигранти." +
                "Министърът на вътрешните работи информира, че към момента България очаква помощ със 100 служители от европейската гранична агенция \"Фронтекс\". Специалистите ще пристигнат с техника и обучени кучета.",
                "10.09.2016 19:07"
        ));

        this.articles.add(new Article("Фен нападна журналистка, дават му до 3 г. затвор",
                "Районната прокуратура в Бургас започна бързо досъдебно производство срещу футболния привърженик Манол Тодоров за побой над журналистка. Това съобщиха от прокуратурата." +
                "Инцидентът е станал вчера на стадион \"Лазур\" в Бургас по време на тренировка на футболисти от отбора Нефтохимик." +
                "Пострадалата се казва Стела Божидарова и работи за сайта Burgas24.com. За престъплението е предвидено наказание \"лишаване от свобода\" до 3 години." +
                "По делото е назначена съдебно - медицинска експертиза, извършват се и разпити.",
                "10.09.2016 18:56"));

        this.articles.add(new Article("Ген. Радев: Ще бъда президент, който може да казва \"не\"",
               "Кандидатът за президент от БСП ген. Румен Радев гарантира, че ще бъда президент, който може да казва \"не\".\n" +
                       "\n" +
                       "\"Ще работя за национална сигурност, не само като защита от външно посегателство. Ще работя за достойна България, така че всеки българин да се чувства горд, че е такъв. Няма да подведа доверието ви. Поемам отговорността да бъда вашият боец в тази трудна борба“, каза ген. Радев по време на Националното съвещание на БСП.\n" +
                       "\n" +
                       "Той бе категоричен, че кандидат-президентската битка ще бъде изключително трудна. \"Затова, както аз, така и кандидатът за вицепрезидент Илияна Йотова ще разчитаме на вас, на структурите по места\", обърна се той към събралите се.\n" +
                       "\"Моята кандидатурата е ясен знак, че в България има една партия, която се развива и която поема и може да носи отговорност. Това е сигнал към всички български граждани. Не само към симпатизантите и членовете на БСП. Сигнал е, че всички хора, които искат промяна в статуквото, както и да се пробие политическият модел, трябва най-сетне да се обединят. Трябва да се работи с всички хора, които искат промяна, ново бъдеще за България, независимо от техните политически убеждения\", категоричен бе той, цитиран от пресцентъра на БСП.\n" +
                       "\n" +
                       "\"В моята работа ми се е налагало да бъда стратег, да бъда дипломат, да формулирам и отстоявам, както и да налагам позицията на България на различни международни форуми. Налагало ми се е да бъда и мениджър и най-вече ми се е налагало да бъда лидер и да водя по силата на убеждението и личния пример\", обясни кандидатът за президент, издигнат от БСП.\n" +
                       "\n" +
                       "По думите му сега имаме криза на ценностите и криза в управлението. \"И аз като всеки търся причините и отговорите. Причините са много, като първата е, че липсва ясна и дългосрочна визия за страната. Няма обективен и безпристрастен анализ\", обясни той.\n" +
                       "\n" +
                       "Според него се цели обезличаване на президентската институция и на президента, за да бъде той зависим. \"Ние обаче ще бъдем коректив на случващото се“, каза още той.\n" +
                       "\n" +
                       "\"Благодаря ви за огромното доверие. Няма да ви предам“. Това заяви пред Националното съвещание на БСП кандидатът на БСП за вицепрезидент Илияна Йотова. Тя се обърна към ген. Радев с думите \"Няма как да не почувствате как трепти едно доверие към вас и да знаете цената на всеки един глас, който е застанал зад вас. Пред себе си имате най-старата партия в България и почти в цяла Европа\". \n" +
                       "\n" +
                       "Йотова подчерта, че България е без перспектива, в мизерия и бедност. \"Можем ли да направим така, че страната ни да изглежда по друг начин, за да имаме бъдеще ние и децата ни?“, попита тя и подчерта, че президентът има важна роля, за да се промени това. Йотова добави, че в последните пет години един президент, който не е бил избран, а назначен за такъв, е обезсмислил институцията. Тя посочи, че е била свидетел на поведението на Плевнелиев и извън страната, където според нея е карал сънародниците ни само да се срамуват. \"Обещавам ви, че когато спечелим изборите, няма да се срамувате от нас\", категорична бе тя.\n" +
                       "\n" +
                       "Тя бе категорична, че никога повече президентът на България не трябва да позволява страната ни да бъде унижавана, да допуска да има началници.\n",
                "10.09.2016 17:38"));

        //-------------------------------------------------------------------------------------------------

        this.articles.add(new Article("Ромка прави нелегални цигари, задържаха я",
                "Полицията в Пловдив задържа 31 годишна ромка, в чийто дом бяха открити 15 кг контрабанден тютюн. Освен него униформените намерили и машина за обработката му и електронна везна.\n" +
                        "Спецакцията е била проведена в кв. \"Столипиново\", информира  \"24 часа\".\n" +
                        "Ромката е задържана, а срещу нея е образувано бързо производство. \n" +
                        "В ареста е и асеновградчанин, който на ул. \"Шести януари\" бил заловен да пренася общо 54 600 цигари от различни марки без бандерол. \n" +
                        "Междувременно на територията на общинския пазар в Стамболийски служителите на реда установили няколко човека, които предлагат за продажба безакцизен тютюн . От тримата са иззети общо 14 кг.",
                "11.09.2016 11:47"));

        this.articles.add(new Article("Задържаха столичанин за превоз на мигранти от Афганистан",
                "Столичанин с инициали Р. Д. на 40 години е задържан в полицията за превоз на мигранти от Афганистан. Това съобщиха от Областна дирекция на МВР във Видин. \n" +
                        "Чужденците са открити вчера в землището на село Раковица, община Макреш около 18.30 часа в автомобил Фолксваген \"Кади\", шофиран от 40-годишния мъж. В колата са пътували 11 души (петима възрастни и 6 деца), които отговарят на профила \"нелегален мигрант\".\n" +
                        "Чужденците са доведени в РУ-Кула, установена е самоличността им - граждани на Афганистан. Пълнолетните са задържани, на децата е предоставена полицейска закрила. Предстои извеждането им от обслужваната територия.",
                "10.09.2016 13:02"));

        this.articles.add(new Article("Заловиха рецидивист, избягал от затвора в Бургас",
                "Новозагорски криминалисти задържаха рецидивист, избягал от затвора в Бургас, извършил серия кражби от къщи в Новозагорско, съобщиха от Областната дирекция на МВР в Сливен.\n" +
                        "Той е влизал в домовете на хората през отворени прозорци. От края на август в полицията в Нова Загора са регистрирани заявления за кражба на пари, златни накити и други ценности.\n" +
                        "На 8 септември полицейските служители са задържали в новозагорското село Питово криминално проявения и осъждан В.В. от град Камено, област Бургас, обявен за общодържавно издирване като беглец от затвора в Бургас - незавърнал се от домашен отпуск.\n" +
                        "Полицейските служители предприемат незабавни процесуално-следствени действия в обитавания от В.В. имот в Питово. На място е установен и криминално проявения С.С. от град Шивачево.\n" +
                        "От жилището са иззети 8550 лв., 300 евро, голямо количество златни накити, ръчни часовници, мобилни телефони, таблет и други веществени доказателства, свързващи В.В. и С.С. с извършените домови кражби на територията на община Нова Загора. Двамата са задържани за 24 часа.",
                "10.09.2016 12:22"));

        this.articles.add(new Article("Взривиха банкомат в Русе",
                "Банкомат е бил взривен тази нощ в Русе, съобщиха от областната дирекция на полицията в града.\n" +
                        "        В 3,14 часа е получен сигнал за посегателство над банкомат, намиращ се в магазин на улица \"Рига\". На мястото е изпратена дежурна оперативна група на МВР за извършване на оглед и изясняване на случая.\n" +
                        "        При инцидента няма пострадали хора, но са нанесени материални щети по устройството и витрините на магазина. Към момента няма данни да липсват пари от банкомата, допълват от полицията.\n",
                "10.09.2016 11:58"));

        this.articles.add(new Article("Момче от център за социални услуги в Ловеч скочи от сграда",
                " Момче, настанено в Център за наставане от семеен тип /ЦНСТ/ в Ловеч, е направил опит за самоубийство и е скочило от двуетажна сграда в града, съобщиха от областната дирекция на МВР. То е настанено в ловешката болница с леки наранявания и без опасност за живота, добавиха от полицията. За случая е уведомена и прокуратурата.\n" +
                        "        Инцидентът е станал в петък. Около 18.00 часа 17-годишното момче, криминално проявено, е буйствало пред Центъра и на място е извикан екип на \"Самоохрана, контрол, обществен ред и сигурност\" /БД СКОРС/.\n" +
                        "        След това момчето е избягало и се е качило на покрива на бившия закрит басейн в града. Заплашило е, че ще се самоубие, пристигнали са екипи на полицията и пожарната.\n" +
                        "        След това младежът е скочил върху площадка. Екип на спешна помощ го е откарал в ловешката болница, където е настанен в детското отделение. От Центъра за спешна медицинска помощ съобщиха, че момчето е било с алкохолна интоксикация и е буйствало.\n",
                "10.09.2016 10:52"));

        this.articles.add(new Article("Шестима загинаха при 20 тежки катастрофи през денонощието",
                "През изминалото денонощие по пътищата на страната са загинали шестима души при 20 тежки катастрофи, съобщи пресцентърът на МВР.\n" +
                        "        Ранените са 19, като един от тях е с опасност за живота.\n" +
                        "        В София са станали 136 леки катастрофи и две тежки. Един човек е загинал, а двама са ранени.\n" +
                        "        От началото на годината 475 души са загубили живота си при пътни произшествия.",
                "10.09.2016 09:32"));

        this.articles.add(new Article("Изоставен багаж вдигна на крак полицията в София",
                "Изоставен багаж вдигна на крак полицията в София тази нощ.\n" +
                        "        Беше извършен контролиран взрив на багажа, изоставен на една от алеите зад джамията, съобщи Нова тв.\n" +
                        "        Силният гръм от взрива малко след 23.00 часа изправи на нокти живеещите в района на Централните хали. Джамията и градинката зад нея бяха отцепени от полицията. На място имаше екипи на Спешна помощ и пожарната.\n" +
                        "        Според живеещите наоколо багажът бил оставен от бежанци, които отдавна били превърнали градинката в свой дом. По пейките често оставяли дрехи, обувки и одеяла. Жителите на района твърдят, че отдавна вече избягват от там.\n" +
                        "        След като изоставеният багаж беше обезвреден, екип на ДОТИ започна работа по установяване на съдържанието му.",
                "10.09.2016 08:48"));

        this.articles.add(new Article("Меркел ни праща джипове за охрана на границата ни",
                "Ocем нови високопроходими джипове ще пристигнат в България от Германия. Новите машини трябва да пристигнат през ноември. Те са обещани лично от канцлера Ангела Меркел." +
                        "България ще получи още термовизионни камери и автобуси. Това каза пред журналисти министърът на вътрешните работи Румяна Бъчварова. Днес тя посети южната граница, където се строи пограничното оградно съоръжение." +
                        "До няколко дни ще пристигнат и джипове втора употреба, но в добро състояние, предаде БТА." +
                        "Бъчварова каза, че цялата техника ще бъде разположена в местния пограничен район.Част от английските джипове, изпратените от вече бившия британски премиер Дейвид Камерън, са аварирали. Дарението пристигна у нас през май тази година." +
                        "Техниката, която обслужва граничните служители, е зле, заяви Бъчварова. България ще се опита да се справи с наличните в момента бежански центрове, добави министърът. По думите й няма планове за изграждането на нови такива у нас." +
                        "Министърът уточни, че в сравнение с миналата година има спад с 30 на сто на преминалите българо-турската граница мигранти." +
                        "Министърът на вътрешните работи информира, че към момента България очаква помощ със 100 служители от европейската гранична агенция \"Фронтекс\". Специалистите ще пристигнат с техника и обучени кучета.",
                "10.09.2016 19:07"
        ));

        this.articles.add(new Article("Фен нападна журналистка, дават му до 3 г. затвор",
                "Районната прокуратура в Бургас започна бързо досъдебно производство срещу футболния привърженик Манол Тодоров за побой над журналистка. Това съобщиха от прокуратурата." +
                        "Инцидентът е станал вчера на стадион \"Лазур\" в Бургас по време на тренировка на футболисти от отбора Нефтохимик." +
                        "Пострадалата се казва Стела Божидарова и работи за сайта Burgas24.com. За престъплението е предвидено наказание \"лишаване от свобода\" до 3 години." +
                        "По делото е назначена съдебно - медицинска експертиза, извършват се и разпити.",
                "10.09.2016 18:56"));

        this.articles.add(new Article("Ген. Радев: Ще бъда президент, който може да казва \"не\"",
                "Кандидатът за президент от БСП ген. Румен Радев гарантира, че ще бъда президент, който може да казва \"не\".\n" +
                        "\n" +
                        "\"Ще работя за национална сигурност, не само като защита от външно посегателство. Ще работя за достойна България, така че всеки българин да се чувства горд, че е такъв. Няма да подведа доверието ви. Поемам отговорността да бъда вашият боец в тази трудна борба“, каза ген. Радев по време на Националното съвещание на БСП.\n" +
                        "\n" +
                        "Той бе категоричен, че кандидат-президентската битка ще бъде изключително трудна. \"Затова, както аз, така и кандидатът за вицепрезидент Илияна Йотова ще разчитаме на вас, на структурите по места\", обърна се той към събралите се.\n" +
                        "\"Моята кандидатурата е ясен знак, че в България има една партия, която се развива и която поема и може да носи отговорност. Това е сигнал към всички български граждани. Не само към симпатизантите и членовете на БСП. Сигнал е, че всички хора, които искат промяна в статуквото, както и да се пробие политическият модел, трябва най-сетне да се обединят. Трябва да се работи с всички хора, които искат промяна, ново бъдеще за България, независимо от техните политически убеждения\", категоричен бе той, цитиран от пресцентъра на БСП.\n" +
                        "\n" +
                        "\"В моята работа ми се е налагало да бъда стратег, да бъда дипломат, да формулирам и отстоявам, както и да налагам позицията на България на различни международни форуми. Налагало ми се е да бъда и мениджър и най-вече ми се е налагало да бъда лидер и да водя по силата на убеждението и личния пример\", обясни кандидатът за президент, издигнат от БСП.\n" +
                        "\n" +
                        "По думите му сега имаме криза на ценностите и криза в управлението. \"И аз като всеки търся причините и отговорите. Причините са много, като първата е, че липсва ясна и дългосрочна визия за страната. Няма обективен и безпристрастен анализ\", обясни той.\n" +
                        "\n" +
                        "Според него се цели обезличаване на президентската институция и на президента, за да бъде той зависим. \"Ние обаче ще бъдем коректив на случващото се“, каза още той.\n" +
                        "\n" +
                        "\"Благодаря ви за огромното доверие. Няма да ви предам“. Това заяви пред Националното съвещание на БСП кандидатът на БСП за вицепрезидент Илияна Йотова. Тя се обърна към ген. Радев с думите \"Няма как да не почувствате как трепти едно доверие към вас и да знаете цената на всеки един глас, който е застанал зад вас. Пред себе си имате най-старата партия в България и почти в цяла Европа\". \n" +
                        "\n" +
                        "Йотова подчерта, че България е без перспектива, в мизерия и бедност. \"Можем ли да направим така, че страната ни да изглежда по друг начин, за да имаме бъдеще ние и децата ни?“, попита тя и подчерта, че президентът има важна роля, за да се промени това. Йотова добави, че в последните пет години един президент, който не е бил избран, а назначен за такъв, е обезсмислил институцията. Тя посочи, че е била свидетел на поведението на Плевнелиев и извън страната, където според нея е карал сънародниците ни само да се срамуват. \"Обещавам ви, че когато спечелим изборите, няма да се срамувате от нас\", категорична бе тя.\n" +
                        "\n" +
                        "Тя бе категорична, че никога повече президентът на България не трябва да позволява страната ни да бъде унижавана, да допуска да има началници.\n",
                "10.09.2016 17:38"));
    }
}
